<a href="https://colab.research.google.com/github/trista-paul/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/SQL_Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# How many passengers survived, and how many died?

SELECT COUNT(*) FROM "public"."titanic"
  WHERE titanic.Survived = 1
  
  342
  
  SELECT COUNT(*) FROM "public"."titanic"
  WHERE titanic.Survived = 0
  
  545

# How many passengers were in each class?
SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Pclass = 1

216

SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Pclass = 2

184

SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Pclass = 3

487

# How many passengers survived/died within each class?

SELECT COUNT(*) FROM "public"."titanic" WHERE titanic.Survived = 1
AND titanic.Pclass = 1

136

SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Survived = 0
AND titanic.Pclass = 1

80

SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Survived = 1
AND titanic.Pclass = 2

87


SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Survived = 0
AND titanic.Pclass = 2

97

SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Survived = 1
AND titanic.Pclass = 3

119

SELECT COUNT(*) FROM "public"."titanic"
WHERE titanic.Survived = 0
AND titanic.Pclass = 3

368

# What was the average age of survivors vs nonsurvivors?

SELECT AVG(Age) FROM "public"."titanic"
WHERE titanic.Survived = 1

28

SELECT AVG(Age) FROM "public"."titanic"
WHERE titanic.Survived = 0

30

# What was the average age of each passenger class?
SELECT AVG(Age) FROM "public"."titanic"
WHERE titanic.Pclass = 1

38

SELECT AVG(Age) FROM "public"."titanic"
WHERE titanic.Pclass = 2

29

SELECT AVG(Age) FROM "public"."titanic"
WHERE titanic.Pclass = 3

25

# What was the average fare by passenger class? By survival?

SELECT AVG(Fare) FROM "public"."titanic"
WHERE titanic.Pclass = 1

$84.15

SELECT AVG(Fare) FROM "public"."titanic"
WHERE titanic.Pclass = 2

$20.66


SELECT AVG(Fare) FROM "public"."titanic"
WHERE titanic.Pclass = 3

$13.70

SELECT AVG(Fare) FROM "public"."titanic"
WHERE titanic.Survived = 1

$48.39

SELECT AVG(Fare) FROM "public"."titanic"
WHERE titanic.Survived = 0

$22.20

# How many siblings/spouses aboard on average, by passenger class? By survival?

SELECT AVG(siblings_or_spouse) FROM "public"."titanic"
WHERE titanic.Pclass = 1

0.4

SELECT AVG(siblings_or_spouse) FROM "public"."titanic"
WHERE titanic.Pclass = 2

0.4

SELECT AVG(siblings_or_spouse) FROM "public"."titanic"
WHERE titanic.Pclass = 3

0.6

SELECT AVG(siblings_or_spouse) FROM "public"."titanic"
WHERE titanic.Survived = 1

0.4

SELECT AVG(siblings_or_spouse) FROM "public"."titanic"
WHERE titanic.Survived = 0

0.5

# How many parents/children aboard on average, by passenger class? By survival?

SELECT AVG(parents_or_children) FROM "public"."titanic"
WHERE titanic.Pclass = 1

0.35

SELECT AVG(parents_or_children) FROM "public"."titanic"
WHERE titanic.Pclass = 2

0.38

SELECT AVG(parents_or_children) FROM "public"."titanic"
WHERE titanic.Pclass = 3

0.39

SELECT AVG(parents_or_children) FROM "public"."titanic"
WHERE titanic.Survived = 1

0.46

SELECT AVG(parents_or_children) FROM "public"."titanic"
WHERE titanic.Survived = 0

0.33

#Do any passengers have the same name?

SELECT COUNT (DISTINCT name) FROM "public"."titanic"
887

SELECT COUNT (name) FROM "public"."titanic"
887

By deduction, no